<template>
  <div class="root">
    <title-main
      head='ประกาศจากโรงเรียน'
      desc='ประกาศข่าวสารต่าง ๆ และประชาสัมพันธ์'
      align="center"
      color="primary"
    />
    <div class="slider-wrap">
      <div class="carousel" v-if="loaded">
        <slick
          ref="slider"
          :options="slickOptions"
        >
          <div
            v-for="(item, index) in testiContent"
            :key="index"
            class="item"
          >
            <testi-card
              :text="item.text"
              :title="item.title"
              :date="item.date"
            />
          </div>
        </slick>
        <v-btn
          icon
          fab
          class="nav prev"
          @click="slickPrev()"
        >
          <i class="ion-ios-arrow-left" />
        </v-btn>
        <v-btn
          icon
          fab
          class="nav next"
          @click="slickNext()"
        >
          <i class="ion-ios-arrow-right" />
        </v-btn>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
@import './testi-style.scss';
</style>

<script>
import Title from '../Title'
import TestiCard from '../Cards/Testimonial'

const testiData = [
  {
    text:
      'โรงเรียนโพธาวัฒนาเสนี เปิดให้นักเรียนมาเรียนแบบ Onsite (มาเรียนที่โรงเรียน) ในวันจันทร์ ที่ 28 มิถุนายน 2564 โดยจะมีการจัดการเรียนการสอนแบบสลับกันมาเรียน ในส่วนของรายละเอียดเพิ่มเติมอื่นๆ โรงเรียนจะแจ้งให้ทราบในลำดับถัดไปค่ะ สำหรับ วันที่ 21 - 25 มิถุนายน ยังคงจัดการเรียนการสอนในรูปแบบออนไลน์ค่ะ',
    title: 'แจ้งการมาเรียน',
    date: '27 มิถุนายน 2564'
  },
  {
    text:
      'โรงเรียนโพธาวัฒนาเสนี เปิดให้นักเรียนมาเรียนแบบ Onsite (มาเรียนที่โรงเรียน) ในวันจันทร์ ที่ 28 มิถุนายน 2564 โดยจะมีการจัดการเรียนการสอนแบบสลับกันมาเรียน ในส่วนของรายละเอียดเพิ่มเติมอื่นๆ โรงเรียนจะแจ้งให้ทราบในลำดับถัดไปค่ะ สำหรับ วันที่ 21 - 25 มิถุนายน ยังคงจัดการเรียนการสอนในรูปแบบออนไลน์ค่ะ',
    title: 'แจ้งการมาเรียน',
    date: '27 มิถุนายน 2564'
  },
  {
    text:
      'โรงเรียนโพธาวัฒนาเสนี เปิดให้นักเรียนมาเรียนแบบ Onsite (มาเรียนที่โรงเรียน) ในวันจันทร์ ที่ 28 มิถุนายน 2564 โดยจะมีการจัดการเรียนการสอนแบบสลับกันมาเรียน ในส่วนของรายละเอียดเพิ่มเติมอื่นๆ โรงเรียนจะแจ้งให้ทราบในลำดับถัดไปค่ะ สำหรับ วันที่ 21 - 25 มิถุนายน ยังคงจัดการเรียนการสอนในรูปแบบออนไลน์ค่ะ',
    title: 'แจ้งการมาเรียน',
    date: '27 มิถุนายน 2564'
  },
  {
    text:
      'โรงเรียนโพธาวัฒนาเสนี เปิดให้นักเรียนมาเรียนแบบ Onsite (มาเรียนที่โรงเรียน) ในวันจันทร์ ที่ 28 มิถุนายน 2564 โดยจะมีการจัดการเรียนการสอนแบบสลับกันมาเรียน ในส่วนของรายละเอียดเพิ่มเติมอื่นๆ โรงเรียนจะแจ้งให้ทราบในลำดับถัดไปค่ะ สำหรับ วันที่ 21 - 25 มิถุนายน ยังคงจัดการเรียนการสอนในรูปแบบออนไลน์ค่ะ',
    title: 'แจ้งการมาเรียน',
    date: '27 มิถุนายน 2564'
  },
  {
    text:
      'โรงเรียนโพธาวัฒนาเสนี เปิดให้นักเรียนมาเรียนแบบ Onsite (มาเรียนที่โรงเรียน) ในวันจันทร์ ที่ 28 มิถุนายน 2564 โดยจะมีการจัดการเรียนการสอนแบบสลับกันมาเรียน ในส่วนของรายละเอียดเพิ่มเติมอื่นๆ โรงเรียนจะแจ้งให้ทราบในลำดับถัดไปค่ะ สำหรับ วันที่ 21 - 25 มิถุนายน ยังคงจัดการเรียนการสอนในรูปแบบออนไลน์ค่ะ',
    title: 'แจ้งการมาเรียน',
    date: '27 มิถุนายน 2564'
  },
  {
    text:
      'โรงเรียนโพธาวัฒนาเสนี เปิดให้นักเรียนมาเรียนแบบ Onsite (มาเรียนที่โรงเรียน) ในวันจันทร์ ที่ 28 มิถุนายน 2564 โดยจะมีการจัดการเรียนการสอนแบบสลับกันมาเรียน ในส่วนของรายละเอียดเพิ่มเติมอื่นๆ โรงเรียนจะแจ้งให้ทราบในลำดับถัดไปค่ะ สำหรับ วันที่ 21 - 25 มิถุนายน ยังคงจัดการเรียนการสอนในรูปแบบออนไลน์ค่ะ',
    title: 'แจ้งการมาเรียน',
    date: '27 มิถุนายน 2564'
  },
  {
    text:
      'โรงเรียนโพธาวัฒนาเสนี เปิดให้นักเรียนมาเรียนแบบ Onsite (มาเรียนที่โรงเรียน) ในวันจันทร์ ที่ 28 มิถุนายน 2564 โดยจะมีการจัดการเรียนการสอนแบบสลับกันมาเรียน ในส่วนของรายละเอียดเพิ่มเติมอื่นๆ โรงเรียนจะแจ้งให้ทราบในลำดับถัดไปค่ะ สำหรับ วันที่ 21 - 25 มิถุนายน ยังคงจัดการเรียนการสอนในรูปแบบออนไลน์ค่ะ',
    title: 'แจ้งการมาเรียน',
    date: '27 มิถุนายน 2564'
  }
]

export default {
  components: {
    'title-main': Title,
    TestiCard,
    Slick: () => import('vue-slick')
  },
  data() {
    return {
      loaded: false,
      currentSlide: 0,
      testiContent: testiData,
      slickOptions: {
        dots: false,
        infinite: true,
        speed: 500,
        autoplay: true,
        autoplaySpeed: 7000,
        slidesToShow: 2,
        arrows: false,
        pauseOnHover: true,
        responsive: [
          {
            breakpoint: 960,
            settings: {
              slidesToShow: 1,
              slidesToScroll: 1
            }
          }
        ]
      }
    }
  },
  mounted() {
    this.loaded = true
  },
  methods: {
    slickNext() {
      this.$refs.slider.next()
    },
    slickPrev() {
      this.$refs.slider.prev()
    }
  },
  computed: {
    isDesktop() {
      const lgUp = this.$store.state.breakpoints.lgUp
      return lgUp.indexOf(this.$mq) > -1
    }
  }
}
</script>
